Revit 2027 API
BuiltInFailures.StructuralLoadFailures Class
 Failures about Load.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class StructuralLoadFailures
Public NotInheritable Class StructuralLoadFailures
public ref class StructuralLoadFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralLoadFailures = class end
The BuiltInFailures.StructuralLoadFailures type exposes the following members.
Properties
Name | Description
CannotMirrorBoundaryCondition |  Can't mirror Boundary Conditions
CannotMoveBoundaryCondition |  Can't move Boundary Conditions
CannotPlaceBoundaryConditions |  A boundary condition is already created on the selected element. Duplicate boundary conditions are not allowed. Click the Replace button to delete previous definition of boundary condition or cancel the operation.
HostChangeDisallowsLoadOrBoundaryConditions |  Some Hosted Loads or BoundaryConditions lost their References. They will be deleted.
Top
See Also
Reference
Autodesk.Revit.DB Namespace